{
  "professional": [
    {
      "id": "aveni-meeting-assistant",
      "title": "Aveni Meeting Assistant",
      "subtitle": "Mobile-driven meeting capture and AI note generation",
      "shortDescription": "The Aveni Meeting Assistant is an AI-powered mobile app that allows financial advisors to record face-to-face meetings with clients and automatically process them for real-time insights, compliance monitoring, and intelligent summaries.",
      "longDescription": "Led the entire app development from conception to production, building cross-platform mobile applications for both Android and iOS using React Native and Expo, ensuring consistent user experience across all devices.\nEstablished and maintained the complete CI/CD pipeline automation for deployment using EAS (Expo Application Services), enabling seamless and reliable app distribution to both app stores. Worked with fast iterations and close collaboration with design and product management teams to ship the best possible user experience, ensuring rapid delivery while maintaining high quality standards.",
      "role": "Lead Frontend Engineer",
      "tags": [
        "React Native",
        "Expo",
        "TypeScript",
        "EAS",
        "CI/CD",
        "Jest",
        "React Native Testing Library"
      ],
      "achievements": [
        "Led the entire app development from conception to production",
        "Built cross-platform mobile apps for Android and iOS using React Native and Expo",
        "Established complete CI/CD pipeline automation with EAS for seamless deployment",
        "Collaborated closely with design and product teams using fast iteration cycles",
        "Built comprehensive testing suite using Jest and React Native Testing Library"
      ],
      "externalLinks": [
        {
          "type": "linkedin",
          "label": "LinkedIn Announcement",
          "url": "https://www.linkedin.com/posts/aveni-ai_just-dropped-you-asked-and-we-listened-activity-7226967863754960898-keFg"
        },
        {
          "type": "website",
          "label": "Learn More",
          "url": "https://aveni.ai/blog/aveni-meeting-assistant-now-available/"
        }
      ]
    },
    {
      "id": "aveni-detect",
      "title": "Aveni Detect",
      "subtitle": "100% AI-powered QA assessment",
      "shortDescription": "Aveni Detect is an advanced AI detection system that automatically analyzes financial communications, documents, emails, and conversations to identify potential compliance risks and regulatory issues before they become problems.",
      "longDescription": "Worked closely with the technical lead to recreate the entire frontend from scratch, implementing modern patterns and easily testable multi-layer architecture that is agnostic from the UI framework used.\nBuilt a comprehensive custom design system using Storybook, ensuring consistency and reusability across the application while improving development velocity and maintaining design standards. Mentored junior engineers throughout the development process and implemented a robust testing strategy encompassing unit testing with Jest, integration testing, and end-to-end testing with Playwright.",
      "role": "Senior Frontend Engineer",
      "tags": [
        "React",
        "TypeScript",
        "Styled Components",
        "Storybook",
        "Jest",
        "React Testing Library",
        "Playwright",
        "Multi-layer Architecture"
      ],
      "achievements": [
        "Rebuilt frontend from scratch using modern React patterns",
        "Architected easily testable multi-layer architecture agnostic from UI framework",
        "Built comprehensive custom design system with Storybook",
        "Mentored junior engineers on best practices and architectural patterns",
        "Implemented complete testing strategy: unit, integration, and e2e tests",
        "Achieved high test coverage and application reliability"
      ],
      "externalLinks": [
        {
          "type": "website",
          "label": "Product Overview",
          "url": "https://aveni.ai/aveni-detect/"
        }
      ]
    },
    {
      "id": "aveni-assist",
      "title": "Aveni Assist",
      "subtitle": "AI assistant for client admin automation",
      "shortDescription": "Aveni Assist is an intelligent assistance platform that provides financial advisors with AI-driven insights, automated recommendations, and comprehensive tools to enhance client interactions and improve advisory services.",
      "longDescription": "Led the recreation of the entire frontend from scratch, gradually rebuilding the application using modern React patterns and architecture to improve maintainability and performance.\nImplemented a component-driven development approach using modern technologies including React, TypeScript, SCSS, and Mantine UI library for consistent design and user experience. Ensured seamless migration from the legacy system while maintaining business continuity and improving overall application performance and developer experience.",
      "role": "Senior Frontend Engineer",
      "tags": [
        "React",
        "TypeScript",
        "SCSS",
        "Mantine",
        "Frontend Architecture",
        "Component-driven Development",
        "CI/CD improvements",
        "Jest",
        "React Testing Library",
        "React Query"
      ],
      "achievements": [
        "Led complete frontend recreation from scratch using modern React patterns",
        "Implemented gradual migration strategy ensuring business continuity",
        "Built responsive and accessible UI components with Mantine",
        "Architected scalable component-driven development approach",
        "Optimized application performance and developer experience",
        "Delivered seamless transition from legacy system to modern architecture",
        "Implemented CI/CD improvements for faster and more reliable deployments"
      ],
      "externalLinks": [
        {
          "type": "website",
          "label": "Product Overview",
          "url": "https://aveni.ai/aveni-assist/"
        }
      ]
    }
  ],
  "personal": [
    {
      "id": "easly-grocery-list-organizer",
      "title": "Grocery List Organizer: Easly",
      "subtitle": "Smart, store-aware grocery and shopping list app",
      "shortDescription": "Easly is a smart grocery list organizer that learns each store’s layout, auto-groups items by aisle, and makes grocery trips faster, calmer, and easier to share with others.",
      "longDescription": "Designed and built Easly as a fully offline-first grocery list organizer using React Native and Expo, structured with a multi-layer architecture for maintainability and clear separation of concerns. The app stores data locally with SQLite and uses MMKV for lightweight preferences, ensuring fast performance and reliability even offline.\nImplemented smart routing, per-store layouts, and an auto-learning Route Mode: Easly observes how the user actually moves through the store and updates aisle order accordingly, so each shopping session follows the real in-store flow and reduces backtracking. Set up an EAS-based CI/CD pipeline, optimized the App Store presence with a multilingual listing (titles, subtitles, descriptions, keywords, and screenshots), and iterated on an ASO strategy to improve organic discovery.",
      "role": "Indie Developer",
      "tags": [
        "React Native",
        "Expo",
        "TypeScript",
        "SQLite",
        "Drizzle ORM",
        "MMKV",
        "Supabase",
        "PostgreSQL",
        "Zustand",
        "EAS",
        "ASO",
        "Offline-first Architecture"
      ],
      "achievements": [
        "Designed and shipped a production-ready iOS app as a solo indie project",
        "Implemented a multi-layer, offline-first architecture using SQLite + MMKV",
        "Built smart route mode that auto-learn user flow to minimize backtracking in the store",
        "Set up CI/CD with EAS for repeatable, automated builds and releases",
        "Crafted a multilingual App Store listing and iterated on an optimised ASO strategy"
      ],
      "lastUpdated": "2025-12-02",
      "externalLinks": [
        {
          "type": "website",
          "label": "App Landing Page",
          "url": "https://easly.h2adigital.com/"
        }
      ]
    }
  ]
}
